
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Видимость = Ложь;
	
	Если Параметры.АнализируемыйДокумент.ОбъектСистемы.ВестиВерсии Тогда
		Если Параметры.АнализируемыйДокумент.ОбъектСистемы.ВестиВариантыОбъектов Тогда
			Если Параметры.АнализируемыйДокумент.ВариантОбъекта.ВестиВерсии Тогда
				Заголовок = "Версии";
				ОтображатьЗаголовок = Ложь;
				Видимость = Истина;
			Иначе
				Заголовок = "Версии не ведутся";
			КонецЕсли;
		Иначе
			Заголовок = "Версии";
			ОтображатьЗаголовок = Ложь;
			Видимость = Истина;
		КонецЕсли;
	Иначе
		Заголовок = "Версии не ведутся";
	КонецЕсли;
	
	Элементы.Версии.Видимость = Видимость;
	
	Версии.Параметры.УстановитьЗначениеПараметра("АнализируемыйДокумент", Параметры.АнализируемыйДокумент);
КонецПроцедуры
