
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ГУИД = XMLСтрока(ТекущийОбъект.Ссылка);
	
	Для Каждого СтрокаДоступныеОбъектыСистемы Из Объект.ДоступныеОбъектыСистемы Цикл
		СтрокаДоступныеОбъектыСистемы.ВариантыОбъектовВедутся = СтрокаДоступныеОбъектыСистемы.ОбъектСистемы.ВестиВариантыОбъектов;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	НастройкаЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭлементовФормы()
	Элементы.ДоступныеОбъектыСистемы.Видимость = Объект.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ЭлементыОбъектовСистемы"));
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОбъектыСистемыОбъектСистемыПриИзменении(Элемент)
	ВариантыОбъектовВедутся = ?(Элементы.ДоступныеОбъектыСистемы.ТекущиеДанные.ОбъектСистемы.Пустая(), Ложь, ДоступныеОбъектыСистемыОбъектСистемыПриИзмененииНаСервере(Элементы.ДоступныеОбъектыСистемы.ТекущиеДанные.ОбъектСистемы));
	Элементы.ДоступныеОбъектыСистемы.ТекущиеДанные.ВариантыОбъектовВедутся = ВариантыОбъектовВедутся;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыСистемыОбъектСистемыПриИзмененииНаСервере(ОбъектСистемы)
	Возврат ОбъектСистемы.ВестиВариантыОбъектов;
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаДоступныеОбъектыСистемы Из Объект.ДоступныеОбъектыСистемы Цикл
		СтрокаДоступныеОбъектыСистемы.ВариантыОбъектовВедутся = СтрокаДоступныеОбъектыСистемы.ОбъектСистемы.ВестиВариантыОбъектов;
	КонецЦикла;
КонецПроцедуры
