
Процедура ПередЗаписью(Отказ)
	Наименование = СокрЛП(Наименование);
	
	Если СтрНайти(Наименование, " ") = 0 
		И Не Предопределенный Тогда
		Наименование = СтрШаблон("%1 _", Наименование);
	КонецЕсли;
	
	СистемноеНаименование = СтрЗаменить(ТРег(Наименование), " ", "");
	
	Если Не ТипЗначения.СодержитТип(Тип("ДокументСсылка.ЭлементыОбъектовСистемы")) Тогда
		ДоступныеОбъектыСистемы.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеКолонки)
	Если Предопределенный
		Или Не ТипЗначения.СодержитТип(Тип("ДокументСсылка.ЭлементыОбъектовСистемы")) Тогда
		ПроверяемыеКолонки.Удалить(ПроверяемыеКолонки.Найти("ДоступныеОбъектыСистемы"));
	КонецЕсли;
КонецПроцедуры

