 
Процедура Тестовая(ТаблицыОбъекта) Экспорт
	//ТаблицаПерсонал = Справочники.ОбъектыСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор("6660783b-6859-11eb-91ca-bcaec5cbeec1"));
	//ТаблицаПерсонал = Справочники.ОбъектыСистемы.НайтиПоРеквизиту("СистемноеНаименование", "ТаблицаПерсонал");
	ОС_ТаблицаПерсонал = Справочники.КонстантыИНастройки.ТестоваяКонстанта.ОбъектСистемы;
	
	Если Не ЗначениеЗаполнено(ОС_ТаблицаПерсонал) Тогда
		Сообщить("Не выполнена настройка алгоритма");
		
		Возврат;
	КонецЕсли;
	
	Для Каждого ТаблицаОбъекта Из ТаблицыОбъекта Цикл
		Если ТаблицаОбъекта.Ключ = ОС_ТаблицаПерсонал Тогда
		//Если ТаблицаОбъекта.Ключ.СистемноеНаименование = "ТаблицаПерсонал" Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаОбъекта.Значение Цикл
				СтрокаТаблицы.ВидДвижения = СтрокаТаблицы.Количество_ >= 0;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры




