
//Процедура ПередЗаписью(Отказ, Замещение)
//	Отказ = Истина;
//КонецПроцедуры

//Процедура ПриЗаписи(Отказ, Замещение)
//	ЭтотОбъект
//КонецПроцедуры

//Процедура ПриЗаписи(Отказ, Замещение)
//	//НЗРС = РазрезыДанныхСведений.ХранилищеЗначенийКолонокОбъектовИстория.СоздатьНаборЗаписей();
//	//НЗРС.Загрузить(ЭтотОбъект.Выгрузить());
//	//
//	//Период = ТекущаяДата();
//	//
//	//Для Каждого СтрокаНЗРС Из НЗРС Цикл
//	//	СтрокаНЗРС.Период = Период;
//	//КонецЦикла;
//	//
//	//НЗРС.Записать();
//КонецПроцедуры
