
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеКолонки)
	Если ЭтоГруппа Тогда
		ПроверяемыеКолонки.Удалить(ПроверяемыеКолонки.Найти("Родитель"));
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПроверкаВыполнена", Истина);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		ПроверкаВыполнена = Неопределено;
		
		Если ТипОбъекта <> Справочники.ТипыОбъектов.Документ Тогда
			//Основания.Очистить();
			//РазрезыДанных.Очистить();
			//КолонкиРазрезовДанных.Очистить();
			
			Если ТипОбъекта <> Справочники.ТипыОбъектов.Справочник Тогда
				Таблицы.Очистить();
			КонецЕсли;
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ПроверкаВыполнена", ПроверкаВыполнена)
			И ПроверкаВыполнена = Истина Тогда
			// идем дальше
		Иначе
			ОшибокНеОбнаружено = ПроверитьЗаполнение();
			
			Отказ = ОшибокНеОбнаружено = Ложь;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		СистемноеНаименование = СтрЗаменить(ТРег(Наименование), " ", "");
	КонецЕсли;
КонецПроцедуры
